// Написать программу вычисления значения функции y = f(a)
// 

double F(double a)
{
    return a*a;
}

System.Console.WriteLine(F(2));
